# ۱. استفاده از یک ایمیج پایه پایتون سبک و بهینه شده
FROM python:3.10-slim

# ۲. تعیین پوشه کاری داخل محیط کانتینر
WORKDIR /app

# ۳. کپی کردن فایل پیش‌نیازها به داخل کانتینر
COPY requirements.txt .

# ۴. نصب کتابخانه‌ها داخل کانتینر بدون ذخیره فایل‌های اضافه (cache)
RUN pip install --no-cache-dir -r requirements.txt

# ۵. کپی کردن تمام کدهای پروژه (مثل main.py) به داخل کانتینر
COPY . .

# ۶. باز کردن پورت ۸۰۰۰ کانتینر برای دسترسی بیرونی
EXPOSE 8000

# ۷. دستور نهایی برای اجرای برنامه به محض روشن شدن کانتینر
CMD ["uvicorn", "main:app", "--host", "0.0.0.0", "--port", "8000"]